Revit 2024 API
FabricationAncillaryUsage.AncillaryWidthOrDiameter Property
 Width or diameter of required ancillary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public double AncillaryWidthOrDiameter { get; }
Visual Basic
Public ReadOnly Property AncillaryWidthOrDiameter As Double
	Get
Visual C++
public:
property double AncillaryWidthOrDiameter {
	double get ();
}
See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace